[
  {
    "objectID": "80320a2bc38ccb81b92fc530a6cc62a802f780bc",
    "permalink": "/post/hardware/hardware-04/",
    "title": "记一次网络丢包问题排查","content": " 记一次网络丢包问题排查 初次收到的问题反馈为：部分机器（一半）丢包比较严重。\n开玩笑？我这个PHY调过的，测过丢包和高低温的，怎么可能有问题！\n1、替换法排查 测试新产的机器，所谓不丢包的机器我测的时候也丢包。 拿我手上以前留下来的自己用的裸板进行丢包测试，正常，基本上不丢包。 拿我手上的网络板替换机器上的网络板，丢包——排除网络板的问题。 拿我手上的主板替换机器上的主板，不丢包——主板问题。 2、常规排查 排查PHY部分电路的几个电源电压、纹波情况 排查PHY部分电路的上电时序 排查RGMII信号质量 由于上面替换法排除了PHY部分电路的问题，这几个可以不用查，直接查主板问题。（应不是干硬件的领导的要求，还是测了这些信号🙃）\n主板差异点在于主芯片不一样，我手上使用的是zynq 的zu1，新生产的是zu5。排查ZU1和ZU5的主板电源和上电时序有没有差异（由于领导猜测zu5是不是比zu1娇贵一点，要求排查主板电源电压、纹波、上电时序🙃）。电源和时序均正常。\n3、合理猜测 ZU5和ZU1使用的是同一套代码，只是软件配置需要改一下型号。由于PL出现过编译失败的情况，怀疑是不是编译过程有问题，遂重新编译测试——未解决 无关PHY，那就查PL到PS之间的数据，查到中断异常，一个中断触发了PS多次中断 排查PL输出的中断，PL在线查和引出管脚后用示波器转中断信号，均未发现中断时间间隔明显拉长或缩短或连续触发的情况 PS中断异常，找不到原因\n4、意外发现 某次瞎几把测试的过程中： PL：把网口重启一下看看？那个命令怎么写来着？ PS：ifconfig eth0 down和ifconfig eth0 up PL：ifconfig eth0 down ，回车！ 我：诶！不对，我们连的ssh……\n好了，这下网卡起不来了，网口都down了，连不上了，只能插串口了，劈里啪啦找串口插上。\nPL：这打印的什么东西？怎么上位机显示丢包的时候就打印这个？ PS：我没动这块代码啊？ 我：换zu1的板子看看\n……\nZU1没这个打印，同一套代码，在ZU1上正常，在ZU5上有打印，打印信息为检测SD卡。于是设备树直接禁用SD卡，麻溜的编了一版刷进去，果然没丢包了。\n结论就是这个检测SD卡的中断影响到了PS那边的中断，PS接收的数据并不是丢包，只是中断号重复了，以为丢了一个周期的包，最终表现在了上位机检测网络包时认为是丢包。至于为什么同一套代码ZU1和ZU5的表现不一致，那鬼知道。\n","date": "2026-01-23 16:02:00",
    "updated": "2026-01-23 16:02:00"
  }, 
  {
    "objectID": "3f7dc8ed1ff65d3f4a1663e1e6f487771dffd131",
    "permalink": "/post/hardware/hardware-03/",
    "title": "本安认证电路设计","content": " 本安认证电路设计 1、电源设计上的电容要求 参考GB/T 3836.4 的表A.2 电压和设备类别相对应的允许电容\nⅠ类设备，额定输入电压12V时，1.5倍安全系数时的电容限值为38uF。\n设备内部存在12V升压到22V的升压电路，留有余量的情况下，按24V算，允许电容为5.25uF\n设备内部还存在12V转5V，转3.3V，5V转1.8V，1.5V，1.2V等等各种低压电路，按这个表算，这些低电压的电源部分，无需对电容进行限制。\n2、电源设计上的限压限流 12V------升压-----22V │ │-----降压-----5V │ │ │ │-----3.3V │ │ │ │-----1.8V │ │ │ │-----1.5V │ │ │ │-----1.2V │ │ │ …… │ │-----降压-----3.3V 12V电容不超过38uF 22V电容不超过5.25uF 5V和3.3V以及后级的更低电压的电源电容不做限制 这里需要考虑另外一个点，如果降压芯片损坏，后级电源与前级12V短路怎么办？\n例如，如果5V和12V短路，5V上的电容就直接加在了12V上，由于5V没做电容容值限制，这时候12V的电容会明显超标。因此需要在12V的两个降压电路后级，也就是5V和3.3V上增加限压电路。\n升压电路同理也要先加限压电路，还有另外一点，由于升压电路的拓扑结构（12V到22V之间有个正向的二极管），决定了升压电路后级的所有电容，需要被计算在前级的12V上。所以计算12V电源网络上的电容时，要将22V电源上的电容一同加上。\n参考GB/T 3836.4 的表A.1 电压和设备类别相对应的允许短路电流\n12V及以下没有相关要求，因此，仅需对升压电路做限流限制。实际使用22V，我们是按24V标准设计的，因此按24V限流704.7mA设计限流即可。\n本安认证代理方给的建议是，在国标限值的基础上再留有余量，基本上就是再砍半。标准700mA限流，就只做350mA限流；标准限定38uF，实际限值到19uF。这样能保证通过测试，如果影响到性能，到时候测试的时候根据情况再增加电容测试。\n3、火花测试 本安火花测试，以22V为例。\n将22V的电源和地飞线拉出来，接入火花机进行短路测试，若能点燃混合气体意味着测试失败。\n将22V电源在板上找地方切断，切断的两边飞线出来接入火花机进行短路测试，若 …","date": "2026-01-22 16:02:00",
    "updated": "2026-01-22 16:02:00"
  }, 
  {
    "objectID": "14aa60e5f557cb7e846eadadba7515c2c5484de8",
    "permalink": "/post/hardware/hardware-02/",
    "title": "网口浪涌防护电路","content": " 网口浪涌防护电路 一般以太网电路，网络变压器左侧差分信号接PHY芯片，右侧差分信号接外部RJ45端。\n1、共模防护 上面网络变压器右侧的75R电阻和1nF电容电路，叫做Bob-Smith电路，浪涌事件存在于信号线到G之间时，信号线上的浪涌能量通过网变的中心抽头，再经过75R电阻和1nF电容到G。这个Bob-Smith电路主要就是作为浪涌的共模防护。\n其中75R电阻，选择0402封装明显是错误的，测试的时候，一打一炸。其封装至少应该在0805以上，具体可以通过浪涌等级来计算，由于我不会，直接上1206。\n2、差模防护 一般浪涌应该是共模浪涌，但测试也要求测差模。 差模防护主要靠这部分TVS：\n浪涌信号在经过网络变压器之后，能量已经有了一定的衰减，但是还是会耦合到变压器次级线圈上，网变到PHY之间的信号线上，增加TVS就可以将浪涌钳住。\n3、保险起见 为保险起见，还可以在网变到RJ45侧的信号上增加气体放电管，差模共模都能防：\n还有一种三端气体放电管，也很适用：\n","date": "2026-01-21 18:02:00",
    "updated": "2026-01-21 18:02:00"
  }, 
  {
    "objectID": "6d44d2e370a0daacce0328cfa88a59a63a02da6a",
    "permalink": "/post/hardware/hardware-01/",
    "title": "直流电源浪涌防护经验","content": " 直流电源浪涌防护经验 有款产品应用场景为工业场景，原本默认是输入12V，但客户环境通常希望接入24V电源。因此电源口浪涌防护按24V标准做测试。\n1、错误防护 公司祖传的直流电源入口处的电路图如下：\n这个电路中，D3二极管作用是防反接。D6是TVS管，可以吸收静电和浪涌能量。B1为气体放电管，也是作为浪涌防护器件。L4电感在此处的作用，只能看作是电源滤波，可能还有B1和D6之间的解耦功能。\n其中明显的错误点是，B1气体放电管的接法不对，气体放电管有个参数叫弧光电压（Arc Voltage），这个型号的气体放电管的弧光电压约为15V。\n在浪涌测试时，会有一个高压施加在气体放电管上，气体放电管击穿放电，可以看到放电管中间区域放电发光。而当放电管击穿放电时，只需要两端维持住15V，这个电压就可以维持放电管持续弧光放电。而我们的24V电源明显超过这个参数，因此，这里的接法不正确，这种接法可以用在信号线上，用在低压电源上，但是不能用在24V电源上。这个气体放电管可以放在板内GND和外壳屏蔽G之间，测试共模浪涌时有用。\n2、错误防护 测试时修改的错误防护电路：\n对比之前的防护电路，新加了压敏电阻和保险丝（保险丝实测的时候没加），但实际测试无法正常防护，后级DCDC会损坏。\n其原因在于L1电感的位置不正确，L1电感的作用是解耦合，电源进来先过一遍压敏电阻，通过电感解耦合之后，再通过TVS吸收剩余的超额能量，电感应该在压敏和TVS之间。并且感值选大一点，解耦效果更明显，也就是越有可能通过浪涌测试。\n3、正确防护 整改后可以通过测试的正确浪涌防护电路如下（测试时没带保险丝，浪涌测试也通过了，实际产品后来改板还是保险起见加上了保险丝）：\n要求线对线打1kV，线对地打2kV。\nVCC和GND之间打1kV\n浪涌先通过压敏电阻吸收一波 经过解耦电感，将压敏电阻和TVS分开 TVS再进行更精密的钳位 稳定后的电源再通过二极管送到整板系统 VCC和GND对G之间打2kV\n浪涌通过压敏电阻和气体放电管进行能量泄放 没钳住的通过TVS吸收 防护器件选型需要根据测试电压等级进行选型！懒得算就力大砖飞，往大了干！\n4、其他问题 测试过程中，出现了电源掉电问题。防护器件正常防护后，电源电压被拉到了0V，并持续了几个毫秒，导致系统掉电。\n解决办法：防护电路后级加大电容，电源上并3个220uF的大电容。整机 …","date": "2026-01-21 16:02:00",
    "updated": "2026-01-21 16:02:00"
  }, 
  {
    "objectID": "9e7006a6119fa1377e799ba5b67e541614047422",
    "permalink": "/post/read/20260113-import-18/",
    "title": "读书 | 《怎样选择成长股》","content": " 读书 | 《怎样选择成长股》 作者：美国 菲利普.A.费舍 1958年出版\n为什么要选择成长股？\n如果某只股属于成长股，那么他未来的发展一定很大，股价肯定会大涨。只是这个过程通常会经历很长的时间，会经历较大的波折。真正优秀的成长股，卖出的时机永远不会到来。选择这种股的行为在现在一般称为价值投资，相对的，在股市中高抛低吸，预测股价上涨或者下跌的投资方式，称为炒股，或者叫投机。\n想要选到优秀的企业，最好的办法就是做好充足的调查，而最好的调查方式则是“闲聊”。但是这个“闲聊”并不是我们和周边朋友家人侃大山似的闲聊，而是找到所调查的公司的高级管理人员、研究人员、底层工作人员、企业竞争对手、企业的客户和供应商等等，与这些人闲聊。很明显，对于平民投资人来说，这不现实，我们没有可能去结识这些高级管理人员，连人家的门口都进不了，也没有这么多的时间去调查这些信息。\n我们所能做的，就是以互联网为基础，了解公司所在的市场是否有潜力，公司是否有足够的创造力，公司的竞争力是否足够，公司的管理层是否优秀。这些通过互联网得到的信息，虽然会有失真，但只要认真分析，犯错的概率是会很小的。\n很多投资人看重企业分红，而分红稳定的企业，一般都在行业中站稳了脚跟，有了稳定的业务，公司的成长性相对来说并不会特别迅速。这种股在现在被称为老登股，有稳定分红，但股价基本随大盘或者横盘不动。另一种就是分红很少或者没有分红的企业，这些企业包括很多初创公司，业绩下滑的公司，将要退市的公司，以及很少一部分的成长型公司。成长型公司需要大量资金扩张业务、投资新产品等，如果他们将收益用来分红，那他们成长的脚步就会放缓，在市场的拼杀中，不进则退，企业要不断进步才能活下来。所以选择成长股就需要在一大推的股票中，挑选出正真优秀的公司，而这个公司，可能并没有分红或者分红很少。\n什么时候买进？\n当投资人考虑买进某支股时，常常会根据之前的股价走势、历史盈利情况来评估当前股价是否过高，是否适合买入。如果股价刚刚经历了一轮拉升，投资人通常会希望再等等，等股价回调后再买进，是为了节省一部分投资成本。但如果股价一直没有回调到低于当前的价格，投资人一直没有买进，那么投资人会损失这支股所有的成长价值。公司能成长到哪一步，盈利应该到达的点，股价可能涨到多少，这些应该看公司的未来，而不是看这家的公司的历史。只要所评估的未来成长点远高于现在的股价，那么现在 …","date": "2026-01-13 16:18:00",
    "updated": "2026-01-13 16:18:00"
  }, 
  {
    "objectID": "5ecb3c79cd9a2ae0f89e0c8cff384cb82b7462b9",
    "permalink": "/post/knowledge/20260113-import-17/",
    "title": "流感是怎么来的","content": "流感是怎么来的\n流感病毒广泛存在于自然界动物中，特别是禽类，如鸡鸭鹅，以及部分哺乳动物，如猪。\n禽类与人基因差异或许比较大，流感无法直接感染人类，需要中间宿主，如猪。猪既可以感染禽类流感，又可以感染人类流感，病毒在猪体内变异重组，产生新的流感病毒。万年前，人类步入农业社会，逐步开始驯化粮食作物和部分动物，其中鸡鸭猪牛等就属于人类早期驯养的动物。那时的人类与这些动物生活在一起，甚至晚上同住一间房舍。由于人类社会与驯养的鸡鸭鹅和猪过于亲密，新产生的流感病毒便轻易侵入了人类社会，现代社会中的流感病毒同样如此，它们总能通过这些动物侵入到人类社会。\n流感主要在冬季流行，其一是冬季人类活动减少，室内聚集时间增多，病毒传播效率增加。其二是病毒通常为蛋白质，在低温环境下更稳定。\n由于庞大的人类群体以及流感病毒的快速变异速度，流感在某一人群中传播之后，这类人群虽然取得了这个流感的抗体，但是由于流感是不断传播的，即使这类人无法被感染，但它还可以感染其他人，直到流感产生了新的变异，这个新的变异体无法被初始被感染过的群体所免疫，于是它又可以回过头来重新感染之前的人群，不断循环。\n由于病毒演化与动植物的演化一样，都是以生存作为目的的，那么流感病毒会不断演化传播下去，直到被消灭或者与人同在。过于致命的病毒无法得到有效传播，他们会逐渐演化至不那么致命和易于传播。如咳嗽、打喷嚏、流鼻涕、呕吐、腹泻等症状，都是病毒为了方便传播而演化出来的。而发热不属于病毒的症状，属于是人体对病毒的反抗表现，高温会使病毒活性降低，而使免疫系统效率提升。同样，高温也会造成体内各种器官的紊乱，我们的身体是想在杀死自己之前杀死病毒。\n针对流感的常见对抗手段，包括有多通风、戴口罩、勤洗手、打疫苗、保持安全社交距离等，遇到高烧情况需尽快降温并及时就医。\n最好的对抗办法还是要多锻炼身体，多休息，提高免疫力，毕竟流感一波未平一波又起，天天打疫苗吃药也不是个事，时不时得让身体抗一抗病毒的袭击，让免疫系统回想回想被病毒支配的恐惧，也是一种生于忧患的策略。\nEND\n","date": "2026-01-13 16:17:00",
    "updated": "2026-01-13 16:17:00"
  }, 
  {
    "objectID": "8df3b35c15e0c1a8af27086c58237a553b12e39d",
    "permalink": "/post/read/20260113-import-16/",
    "title": "读书 | 《枪炮、病菌与钢铁》","content": "读书 | 《枪炮、病菌与钢铁》\n作者：［美］贾雷德·戴蒙德 1997年出版\n人类不同社会的发展差异，主要是源于地理环境的差异，而不是种族上的差异。\n1\n大陆轴向\n欧亚大陆呈东西走向，且陆地完整；\n美洲大陆呈南北走向，并且在美洲中部只有很窄的陆地相连，在巴拿马运河区域，陆地宽度仅有几十公里，而且在中美洲地区，地形比较破碎，山地雨林很多。\n非洲呈南北走向，并且中部存在撒哈拉大沙漠和刚果热带雨林。\n澳洲岛屿众多，最大的澳大利亚大部分区域属于干旱区域，降雨稀少，气候多变不可预测，土壤贫瘠等。\n气候带主要与纬度和地形有关，同一纬度气候较为相近，所以植物在传播过程中的阻碍较小。若植物想要跨纬度传播，则需要首先适应新的气候条件，才能继续向下一个纬度传播，相对于同纬度传播，难度要大得多。而在有沙漠或者高山等地形阻隔的地区，植物几乎无法跨越区域传播。\n由于大陆轴向差异，欧亚大陆不同地区的植物相互扩散传播难度较低，导致了欧亚大陆上的植物种类比其他大陆要丰富。\n在动物资源方面，作者的《第三种黑猩猩》中有提到过，人类在进入美洲和澳大利亚的时候，造成了当地物种的大灭绝，所以欧亚大陆和非洲的动物种类相对来说更加丰富。\n2\n植物驯化\n人类作为大自然的一部分，也参与了动植物的自然演化。人类偏爱果实大、味道可口的植物，因此植物中果实大而好吃的更容易被人类带离生长地，而果实小而难吃的一部分则需要靠主动扩散和小动物的帮助，长此以往，这种植物留下的基因多是果实大、味道好的种类。人类因此无意中驯化了这种植物，在人类聚居扩大化之后，无意驯化变成了主动驯化，人类开始主动挑选种子大、好吃的植物进行播种。\n由于植物种类多样，出现适于人类食用的植物的概率自然比较大，在欧亚大陆作为主要粮食的是小麦、大麦、豆类；在美洲大陆作为主要粮食的是玉米、南瓜、马铃薯。这些粮食作物在人类的干预下快速演化，极大的丰富了人类的粮食储备。\n3\n动物驯化\n动物的驯化难度要更大一些，只有很少一部分的动物可以被驯化。美洲和澳洲的动物资源不够丰富，非洲的动物资源丰富，但是可以被驯化的很少，只有欧亚大陆适合被驯化的动物很多。欧亚大陆独立驯化的动物有猪、牛、马、驴、羊、鸡、狗等等在现代社会十分重要的动物，这些动物提供了丰富的蛋白质、毛料、皮革以及畜力等资源。植物的驯化导致粮食产量的增加，也让人类有多余的食物用来喂养动物。动物的驯化，让人类有了更多的能 …","date": "2026-01-13 16:16:00",
    "updated": "2026-01-13 16:16:00"
  }, 
  {
    "objectID": "58a3aa6f064393d76cb886185013f5d39ca2d06b",
    "permalink": "/post/knowledge/20260113-import-15/",
    "title": "知识的诅咒","content": " 知识的诅咒 知识的诅咒\n“知识的诅咒”指的是当一个人掌握了某种知识后，就很难想象没有这种知识的人是怎么思考的。这个所谓的知识，并不是指的我们狭义上说的课本上的那种知识，而应该是广义上的知识，基本上可以等同于“信息”。所以知识的诅咒应该指的是，一旦你知道了某个信息，你就很难回到“不知道”的状态去理解他人的思维局限。\n1\n最典型的例子\n如果一个普通人去给小朋友教2+3=5，小朋友可能怎么也不懂，就算你用糖果或者苹果举例，他可能依然听不懂，但对大人来说，明明这么简单的道理，为什么小孩子就是不明白呢？所以我们需要专业的教师，他们会用合适的方法引导小孩子去理解这些知识。\n2\n另一个例子\n我们常常可以在推理小说或者刑侦相关影视剧中看到这样的剧情，犯罪嫌疑人常常在无意中说出只有凶手才知道的细节信息，或者某些细节与他之前编造的内容冲突。这都是因为他们知道某些信息，但要时刻假装不知道这些信息，这是很困难的，稍有疏忽就会露馅。\n3\n其他一些例子\n收敛的反义词是什么？上过高数课的同学脑子中很可能会冒出“发散”两个字，而没上过的同学则可能想到的是“放肆”。\n学会了自行车的人，很难假装不会骑车。除非他再去学着骑一段时间的歪把三轮车。\n战区导弹防御系统的英文缩写叫TMD，但在中文网如果将战区导弹防御系统使用英文缩写的话，没有人会在第一时间想到他的原意。\n4\n下面我要污染你们的知识库了\n在学习英语过程中，要求如果是描述过去发生的，常常要求在词语后面加上“ed”，而英文缩写“ED”所表示的意思为“勃起功能障碍”。\n这是一张小程序二维码，很正常对吧？\n如果看过动物世界，那么你可能看过这么一个场景：\n现在将小程序的二维码和下面图片联想起来：\n如果你看过这个，你应该知道他是一个红酒开瓶器：\n但如果你看过动物世界，那么你可能看过这么一个场景：\n“势”这个字”的本义指：可以压制或控制别人的力量，特指权力。引申指可以影响、控制人的客观力量，又引申泛指局面、形势，再引申为姿态、样子 。\n但是它还有一个意思，表示男性及雄性动物的生殖器官。那么，现在再来看这些成语：势如破竹，势均力敌，大势所趋，装腔作势，势不可挡，仗势欺人，趋炎附势，势不两立，狗仗人势，人多势众，乘势而上，有权有势，以势压人。\n“知识的诅咒”本质是一种认知偏差，知识本身会阻碍我们与他人有效沟通。无论是教学、写作、产品设计还是日常交流，意识到这一点，才能更好地传递信息，减少误解。 END\n","date": "2026-01-13 16:15:00",
    "updated": "2026-01-13 16:15:00"
  }, 
  {
    "objectID": "58455579c68104885874058655af8bc95a87f2b6",
    "permalink": "/post/knowledge/20260113-import-14/",
    "title": "蚂蚁与农牧业","content": "蚂蚁与农牧业\n人类大约在一万年前才由狩猎-采集者向农民转变，开始种植谷物和驯养动物。而蚂蚁在几百万年前，就已经演化出了种植和放牧的才能。\n切叶蚁与农业种植\n切叶蚁中工蚁分迷你工蚁，小型工蚁，中型工蚁，大型工蚁（兵蚁）。\n中型工蚁在巢穴外找到新鲜的叶子后，会用锋利的下颌，像裁纸刀一样在叶片上裁剪出适合搬运的大小，再运回巢穴。\n但是切叶蚁并不直接以这些叶子为食，而是将其用于培养真菌。这些在叶片被送回蚁巢后，小型工蚁会对叶片进行初步加工，嚼碎、湿润，混合蚂蚁的唾液和粪便，这个程类似于“堆肥”，可以软化叶片和使叶片容易分解。\n接着迷你工蚁会将加工后的叶浆制作成蓬松多孔的形态，来增加表面积。再从蚁巢内的真菌菜园中，取出一小块真菌，种到新加工好的叶浆上。\n种植的真菌菜园中可能会长出不是切叶蚁需要的真菌，他们会像农民除草一样，仔细清理这些杂菌。同时他们还会提供排泄物给他们的菜园提供养分。\n当真菌末端长出菌丝球，就到了收获的季节，这些菌丝球富含蛋白质和糖分，而切叶蚁就是以这些菌丝球为食。他们会将这些菌丝球分配给蚁群中的其他成员。\n木蚁与放牧\n木蚁中的工蚁会在巢穴附近寻找蚜虫部落，当确定这个蚜虫部落适合作为牧场后，就会通知其他木蚁同伴。越来越多的木蚁来到这里，有的木蚁围绕牧场巡逻，阻止蚜虫的捕食者靠近，他们利用强壮锋利的上颌和喷射的蚁酸攻击敌人。\n有的木蚁甚至还会用泥土和植物碎屑搭建防御工事或者畜栏，在保护蚜虫的同时还能限制蚜虫活动范围。木蚁还会对牧场周围做清洁，清理霉菌或杂物等。\n木蚁并不直接以蚜虫为食，当木蚁需要取食时，会去抚摸蚜虫，而蚜虫也会十分配合地分泌一种富含糖分的蜜露，这便是木蚁放牧蚜虫的目标产物。\n当牧场所在地方营养不足以满足蚜虫时，木蚁还会将蚜虫搬运到另外一块鲜嫩多汁的牧场上。\n如果有的蚜虫长了翅膀，木蚁还会咬掉蚜虫的翅膀，防止他们飞走。\n到了冬天，木蚁会将蚜虫的卵带回蚁巢，提供良好的环境来保存虫卵，到了春天虫卵孵化后，再将孵化出的若虫搬运到附近新鲜的植物上，开始第二年的放牧生活。\nEND\n","date": "2026-01-13 16:14:00",
    "updated": "2026-01-13 16:14:00"
  }, 
  {
    "objectID": "a67affc10b343158f0912b3b8a8e6ea52330e459",
    "permalink": "/post/read/20260113-import-13/",
    "title": "读书 | 《第三种黑猩猩》","content": " 读书 | 《第三种黑猩猩》 读书 | 《第三种黑猩猩》\n作者：美国 贾雷德·戴蒙德，1992年出版。很早以前就有的观点，我现在才了解到。原来人与黑猩猩之间的基因差异只有1.6%，人类的石器时代存在了几百万年，但也改变不了那时人的地位与野兽无异，是语言的演化才推动了人类跳跃式的进步。\n1\n为什么是人类而不是黑猩猩\n人类与黑猩猩的生物学差异只有1.6%，这样看来人和野兽其实没什么区别，但为什么人类能够发展壮大到可以支配所有动植物，成为地球霸主呢？以前常听到“人与动物最大的区别在于制造并使用工具”，但实际上人类制造并使用工具已有几百万年，直到4万年前，人类才开始表现出霸主的才能。4万年前，人类脑容量和身体素质已经演化到基本上与现代人无异，但在那个时候，人类声带出现变化，可以更加精密地控制发声，创造更多的语言。因此“语言”才是人类与动物产生区别的关键点。\n动物界没有任何动物的语言比人类语言复杂，复杂的语言让人类可以迅速传达更多的信息。此后人类之间的交流更加频繁，也只有交流与学习，人类才能积累更多的知识用于生存和创造改良工具，否则，人类的知识永远只会停留在族群现有的知识层面。而生存机会的增加和创造的工具，让人类族群得以壮大，族群语言便会更进一步地演化。人类因此开始了称霸之路。\n2\n农业\n一万年前农业兴起，人类无意识地播种和挑选出了对人类有益的种子，此后有意识的选择与播种才出现，人类由狩猎-采集者转变为农民，农业的兴起提高了粮食产量，但降低了食物的种类，由于食物量的增长，人类族群得以扩张；但是食物种类的减少，和密集的人口，也导致了疾病开始在人类中扩散。\n3\n征服世界与物种灭绝\n人类开始从欧亚非大陆扩散，到达澳大利亚，欧洲寒带，西伯利亚，美洲等地区。每当人类出现，当地都会伴随着物种灭绝。人类作为当地的新来物种，不被当地物种视为威胁，同时人类还有各种武器以及合同狩猎等秘笈，于是当地大型动物都进了人类的肚子。而欧亚非大陆地区的动物，与人类共同演化了几百万年，知道躲避人这个物种，所以这些地方的很多大型哺乳动物才得以保留。但是在人类武器改良后，又出现了大规模的物种灭绝。\n4\n为什么是欧亚人侵占澳洲和美洲大陆\n世上有种的观点，认为白人更聪明，基因更优秀，所以他们能侵占澳洲和美洲大陆。\n欧亚大陆处于东西向，很大地区处于同一个气候带，其中动植物的扩散阻碍要小很多。而美洲大陆处于南北向，动植物 …","date": "2026-01-13 16:13:00",
    "updated": "2026-01-13 16:13:00"
  }, 
  {
    "objectID": "d5b7970531c9fb34b6bdf5cdcecad3c80f0104df",
    "permalink": "/post/knowledge/20260113-import-12/",
    "title": "庞氏骗局","content": "一个无本万利的赚钱方法\n我发现一个无本万利的赚钱方法。\n只需要你能说服几个人投资你，你只需要告诉他们你手上有一个投资项目，每年大概能有8%~12%的收益，在一年时间到期后，拿出他们本金的10%给他们，告诉他们这是今年的收益。\n如果他们一年过完就想拿了收益退出怎么办？只需要告诉他们这个投资有2年或3年的封闭期就好了。\n假如只有一个人信你，且只愿意投1000块钱，那么第一年他拿到100块钱之后，有可能会追加投资到5000或1万，那么第二年他拿到500或1000的收益的时候，你就能打开你的口碑了，将会有更多的人愿意投资你。\n假如这时候你收到10万的投资，第三年过完，你只需要拿出其中的1万出来给他们，这样在第四年，你就能获得更多的人来投资，也将收到更多的资金。\n这个时候哪怕前期投资的人封闭期到期，想要撤资，你也是有足够的资金来归还他们的本金，因为新加入的投资人和资金更多了，足够覆盖前期人员的本金和收益。\n而他们的成功撤资，也可以打消其他人的疑虑，可以更加放心的增加投资，那么你就可以滚雪球一样，简简单单赚他10个亿，而且是不需要本金的。\n当你赚够了，不想赚的时候，可以将这份工作交给其他人，留下一部分资金继续运转，剩下的全部拿走。\n是不是很简单的赚钱办法？如此伟大又简洁的赚钱计划，就应该给他起个响亮的名字，不如就叫他“庞氏骗局”吧？\n庞氏骗局\n庞氏骗局的主要特征是，它本身不会产生任何利润，而是以新偿旧，骗局的维持完全依赖于不断涌入的新资金。一旦新资金进入的速度放缓或停止，无法支付“收益”和提现要求，骗局就会瞬间崩塌。\n1919年，意大利裔投机商查尔斯·庞兹在美国波士顿设计了一个投资计划，他声称这个计划利用国际回邮券的汇率价差，可以在90天内为投资者带来40%的巨额收益。在短短一年内吸引了数万名投资人，收到了数百万美元。而他实际操作的内容，就是将后来加入者的资金作为前期投资者的利润发放。骗局在1920年崩盘，大部分投资者血本无归，查尔斯·庞兹入狱。所以此类骗局被命名为“庞氏骗局”\n庞氏骗局的几个特点\n1、低风险，高收益\n投资市场风险与收益一般呈正相关，即收益越高，风险越高。如果一个投资项目承诺“低风险，高收益”，这么难以置信的事情，最好别信。\n2、不透明的投资方式\n骗局操盘手一般会使用一些听起来高大上和晦涩的术语来解释他的投资方式，让大多数人听不懂，听懂了的也没法判断真假。或者干 …","date": "2026-01-13 16:12:00",
    "updated": "2026-01-13 16:12:00"
  }, 
  {
    "objectID": "fa8691dc2ade779cff7faceb0f9a7f52ee258224",
    "permalink": "/post/read/20260113-import-11/",
    "title": "读书 | 《穷查理宝典》","content": "读书 | 《穷查理宝典》\n作者：美国 查理·芒格，在读这本书之前，我一直以为这本书是一本纯粹的投资手册，因为在我的印象中，芒格被提及的时候总是和巴菲特一起，说他们两个的投资思想怎样怎样。读完才发现，这本书中关于投资其实只占了很少一部分，更多的是关于人生和思想，这本书通俗点说应该叫做查理的人生经验。\n1\n查理·芒格传\n书中前面一部分讲的是查理的生平事迹，其中包括他的生活、教育、工作经历，还包括他的一些人生感悟，以及晚辈们对于查理的评价和看法。在查理的即席谈话中，查理谈到了投资，好的投资机会是等出来的。在找到了一家有持续竞争优势的优秀企业之后，就可以等待投资他的机会出现，一生之中可能只有那么几次机会，抓住这个机会，在这个优秀的企业的购买价格足够合理甚至低廉的时候买入他，然后只需要坐下来喝茶就可以了。但是，在寻找好的企业的时候，一定要小心财务报表，财务报表是企业花钱请会计进行审计的，而会计是十分会粉饰公司数据的，毕竟“被包养就不要谈什么独立人格”。\n2\n芒格私人书单\n这部分内容是个压缩包，推荐了几十本书籍。芒格认为，要成为有智慧的人，必须要有足够广阔的知识面，所以要读书，读很多很多的书。\n下面是芒格的书单：\n自然\n牛顿《自然哲学的数学原理》\n约翰·葛瑞本《深奥的简洁》\n理查德·道金斯《自私的基因》\n达尔文《物种起源》\n人类\n贾雷德·戴蒙德《第三种黑猩猩》\n史蒂芬·平克《语言本能》\n马特·里德利《基因组》\n贾雷德·戴蒙德《枪炮、病菌与钢铁》\n贾雷德·戴蒙德《崩溃》\n加勒特·哈丁《生活在极限之内》\n阿瑟·赫尔曼《苏格兰：现代世界文明的起点》\n经济\n戴维·S.兰德斯《国富国穷》\n伯纳德·曼德维尔《蜜蜂的寓言》\n本杰明·M.弗里德曼《经济增长的道德意义》\n大卫·李嘉图《政治经济学及赋税原理》\n格里高利·曼昆《经济学原理》\n约翰·肯尼思·加尔布雷思《富裕社会》\n亚当·斯密《国民财富的性质和原因的研究》\n投资\n菲利普·A.费舍《怎样选择成长股》\n劳伦斯·A.克尼厄姆《向格雷厄姆学思考，向巴菲特学投资》\n罗伯特·哈格斯特朗《巴菲特的投资组合》\n本杰明·格雷厄姆《聪明的投资者》\n罗杰·洛温斯坦《拯救华尔街》\n弗兰克·帕特诺伊《诚信的背后》\n人生\n狄更斯《圣诞欢歌》\n毛姆《人生的枷锁》\n欧文·斯通《筚路蓝缕的先行者》\n富兰克林《富兰克林自传》\n赫尔伯特·A.西蒙《我生活的种种模式》\n荣·切 …","date": "2026-01-13 16:11:00",
    "updated": "2026-01-13 16:11:00"
  }, 
  {
    "objectID": "b3803ec97555f2128fe94179d64f49d40a48a9ed",
    "permalink": "/post/read/20260113-import-09/",
    "title": "读书 |《学会提问》","content": "读书 |《学会提问》\n作者：美国 尼尔·布朗，斯图尔特·基利，2013年出版。全书看完，感觉这本书其实应该叫《学会解释》，如果按照书中的方式提问，你的家人朋友们可能会很讨厌你，因为连续不断的深入提问，真的会让别人很难受。但如果反过来想，用书中的方式方法去解释或阐述问题，那么你的观点将会很有说服力。\n1\n论题和结论是什么\n不管别人说什么，特别是他们长篇大论地说个不停的时候，抓住关键点，他说这些话是在讲什么问题，也就是论题；他说了这么多，想表达什么意思，也就是他的结论。只要抓住了这两点，那么其他的内容就是他想要说服你的理由了。\n2\n理由是什么\n除了一般命令形式的对话，生活中大多数对话时，其实都会包含说话人的理由。比如说，“下雨了，今天还是开车上班吧！”，很容易就能发现，他的论题是“要不要开车上班”，结论是“要开车上班”，理由是“下雨了”。当我们要同意或者反对别人的结论时，通常是因为不同意他们的理由，所以找准别人说话中包含的理由，也是至关重要的。\n3\n哪些词语意义不明确\n一般对话中，很少会有结论不明的情况，但是理由通常会出现用词意义不明的情况。或许是说话人没注意到这个用词不当的问题，也或许是说话人故意使用这种意义不明的词语糊弄或者刻意引导说话对象。找到那些过度概括的词，或者模棱两可的词，或者没有明确定义的范围，深入提问。比如说，“天气好的时候我会骑车去上班”，那么“天气好”指的是什么天气？晴天算天气好吗？大晴天算吗？阴天算吗？\n4\n内含的价值观\n每个人都有自己的价值观，这会导致不同的人在听到同一个描述的时候，可能产生不同的结论。比如说，针对人贩子的量刑，网络上可以看到很多的评论，要求对人贩子实施死刑，但实际法律上一般不会对人贩子施行死刑。制定相关法律的人和网络上的普罗大众对于这件事给出了不同的结论，这是因为给这两个群体有不同的内含的价值观，而一个人的价值观是不会直接出现在理由中的，需要我们通过对话，去探寻得到的。\n5\n逻辑上的谬误\n某个理由能推导出某个结论，是因为他们之间有适合的逻辑关联。而在某些推论当中，理由和结论看起来有逻辑关联，实际上是说不通的，但是我们又常常不能第一时间识别这个逻辑上的谬误。比如一个很典型的“人身攻击谬误”：“这个人一看就不是好人，他做这件好事肯定另有图谋！”。这个人是不是另有图谋，是需要我们拿出切实的证据，不能仅仅因为他看起来不像好人，或者平常生 …","date": "2026-01-13 16:09:00",
    "updated": "2026-01-13 16:09:00"
  }, 
  {
    "objectID": "251162ce664ed60014f6414254491cc13a4e31ec",
    "permalink": "/post/knowledge/20260113-import-08/",
    "title": "股票分红中的基本概念","content": "股票分红中的基本概念\n查看某只股的分红信息时，常出现如下信息：\n1\n10派0.88（含税）\n每持有10股，就可以获得0.88元的现金分红，持有1000股就可以获得88元的分红；含税指的是，这0.88元的分红是税前金额，还没有扣除税费的金额。\n2\n分红扣税\n持股期限超过1年：免征个人所得税。\n持股期限在1个月以上至1年（含1年）：税负为10%。\n持股期限在1个月以内（含1个月）：税负为20%。\n3\n股权登记日\n在股权登记日当天，若收盘后还持有的股票，就可以参与分红。若持有1000股，但是在股权登记日当天或者之前就卖掉了300股，那么参与分红的股票就只有700股。\n4\n除权日\n在这一天的股票开盘参考价会将分红的金额扣除掉。除权除息参考价 = 股权登记日收盘价 - 每股现金红利。例如在股权登记日那天的收盘价为10元，每股分红0.088（10股分0.88，1股分0.088），那么除息后的参考价为9.912元。所以分红后，股票账户的总资产不会有变化，股价降低的金额等于账户多出来的现金。甚至如果持有时间在1年内，还因为需要扣税而导致总资金减少。\n5\n填权\n股票价格从除息后的低价位，上涨回升到除息前的价格的过程，称为填权。若没有填权的过程，那么分红就没有产生实质性的收益。\n6\n派息日\n在派息日这一天，分红的钱会到投资账户下。\n7\n开盘价\n除权日当天开盘价，并不是简单前一天收盘价除权出息后的价格，这个价格只是参考价，以这个参考价为基础，在交易日9：15-9：25之间，买卖家下注，平台找一个能实现最大成交量的价格作为开盘价。所有高于该价格的买入申报和低于该价格的卖出申报全部以此价格成交。\n8\n股市其他概念：\n股息率 = 每股年度分红 / 每股股价。若某支股今年每股分红1.2元，分红时股价为30元，那么他的股息率就为1.2/30=4%。\n每股收益（EPS） = 税后利润 / 总股本。这是公司盈利能力的重要指标。若某支股共发行了1000股，公司今年赚了2000块，那么每股收益就为2000/1000=2。\n每股净资产= 净资产 / 总股本。若某个公司发行1000股，公司生产设备等资产有1万元，负债1000元，那么公司的净资产为10000-1000=9000元。每股净资产为9000/1000=9元。\n每股未分配利润：公司历年积累的、尚未分配给股东的利润。\n市盈率（PE）= 股价 / 每股收益 …","date": "2026-01-13 16:08:00",
    "updated": "2026-01-13 16:08:00"
  }, 
  {
    "objectID": "e0bad8a40c053a6b8f814178541c9c4107c3fb83",
    "permalink": "/post/knowledge/20260113-import-07/",
    "title": "长尾理论和马太效应","content": "长尾理论和马太效应\n长尾理论\n头部少量热门产品总销量，和尾部大量冷门产品总销量相差不大，甚至比不过冷门产品总销量\n简单来说，就是“冷门商品”的市场比我们想象的要大得多。\n例如，网络商城中，书籍、衣服、电器等等，按销量排序的话，可以看到头部畅销的产品销量很高，但是种类不算很多。后面的产品销量则微乎其微，但若将后面销量不多的单品的销量全部加起来，是能够和头部热门产品的销量相提并论的。\n现代生产工具的普及，使得很多产品的制作门槛降低，这就导致了长尾中的尾巴变得更长了。以前头部热销产品能获得最大的曝光量，尾部产品则很难获得曝光，而互联网的出现，给了尾部产品曝光的机会。这两个技术方面的进步，使得长尾理论更加符合现实市场。\n虽然互联网的出现，给了尾部产品更多的曝光机会，但是也加剧了头部效应，导致头部热门产品更加热门，能获取比以往更多的关注和收入，表现为“赢家通吃”。另外，由于长尾中的产品太多，用户很难选择到自己喜欢的产品，很可能最终还是回到热门产品中去。所以长尾中的产品，应该走定制化路线，走个性化路线，不去将目光放在太多的用户上，而是聚焦到某一类用户上，尽量满足他们的定制化要求，少量的用户市场也是足够满足小企业的生产生存。\n马太效应\n又称“优势累积效应”，指的是一种“强者愈强，弱者愈弱”的现象。简单来说就是一种的正反馈循环：成功会导致更大的成功，优势会不断累积，最终造成两极分化，形成“赢家通吃”的局面。\n一个成功的个人或者公司，更容易获得关注，于是更容易获得资本的投资，于是更容易得到人才，于是他可以获得更大的成功。\n一个自媒体账号，他的粉丝越多，平台价值越大，更容易获得平台推荐，从而更容易吸引更多的粉丝。\n一个大的企业，他的产品可以通过大规模生产来降低平均成本，甚至可以亏本卖来占领市场，挤压小企业的生存空间。\n所以越是成功的人或企业，越容易成功。反过来也是一样，越不成功的人或企业，越难以成功。手上没有的东西，是很难获取的。想要变成有钱人，你就得先有钱，有了钱才能赚更多的钱，土罐的“以钱赚钱”可不是一句笑话。\n“凡有的，还要加给他，叫他有余；凡没有的，连他所有的也要夺去”——《马太福音》\nEND\n","date": "2026-01-13 16:07:00",
    "updated": "2026-01-13 16:07:00"
  }, 
  {
    "objectID": "a7ed02f5b6fa17d337df0e345399f7e3e0ca32ff",
    "permalink": "/post/knowledge/20260113-import-06/",
    "title": "回归平均","content": "回归平均——可能被高估的惩罚和被低估的鼓励\n当我们习惯了某件事一直保持的稳定状态后，若稳定状态被打破，出现过高或者过低的情况时，这种情况总是会更吸引我们的注意力。而当我们做出一系列措施后，过高或过低的情况消失，重新变成了稳定状态，我们可能会误以为是我们的这一系列措施起了作用，但实际上可能是事情本身回归到了平均水平。\n某个员工工作了1年，从未出现过什么差错，也没有什么很好的表现，但在某一天他犯了一个错，给公司带来了一些损失，于是他的领导找到他，罚款500。在后来的几个月时间内，这个员工果然都没有犯错，领导认为是自己的惩罚制度起了作用。\n另一个员工和上一个员工一起来的公司，也没有犯过什么差错，没有什么很好的表现，但有一天，他有了一次很好的表现，给公司带来了额外的收益，于是他的领导找到他，奖励200。但在后来的几个月时间内，这个员工居然没有一次有更好的表现，于是领导认为，都是奖励制度害的。\n但是实际上，第一个员工基本上不会犯错，在犯错之后也会很快回到平常的水平上去，有没有受到惩罚都是一样的。第二个员工也是一样，有没有奖励都一样，他后续也还是会回归到平均水平上去。但这个领导通过这两件事，会过高评估惩罚的作用，而对鼓励的作用的评估又会过低。\n另一个例子：\n如果有位家长的小孩平常考试分数在80分左右，某次考试考了90分，家长给了他大大的夸奖，还给他买了他喜欢的玩具。但下一次考试的时候，孩子的分数还是只有80分左右，家长就认为，是因为自己给孩子的夸奖，让孩子骄傲了，买的玩具让孩子的心思不在学习上了，这才让孩子成绩又回到80分附近的，认为自己不应该给小孩子奖励。而在小孩子考了60分的时候，家长给孩子一顿打，然后在下次考试时，孩子果然又考到了80分，于是家长就说，你看，小孩子果然还是要打。\n小孩平均成绩在80分左右，不管是因为状态原因也好，还是试卷难度原因也好，超常发挥到90或者发挥失常到60，终究只是一次偏离平均的意外事件，意外过后总会回归平均。\n理解回归平均，防止我们对干预手段做出错误评估。正确评估手段还是应该采用控制变量、对照试验和多次测量等科学手段，谨慎判断，勿被随机波动影响。\nEND\n","date": "2026-01-13 16:06:00",
    "updated": "2026-01-13 16:06:00"
  }, 
  {
    "objectID": "56c46fbde9a313e51ce7751b7334a130727a356c",
    "permalink": "/post/knowledge/20260113-import-05/",
    "title": "逐底竞争（内卷）","content": "逐底竞争（内卷）\n竞争者之间不通过提高产品质量，增加产品创新，提高生产效率来取得胜利，而是通过降低价格，降低标准，剥削劳动力等方式来妄图获取胜利，这样往往会得到全输的局面。简单来说就是内卷，卷到最后大家都讨不到好处。\n某条街道上有两家包子铺A和B，两家的包子都卖10元一份。A店老板觉得卖的太少，赚的钱太少了，为了从B店那边抢生意，于是将包子价格调整到9元一份。果然A店这边的客人比以往更多了，而B店那边人少了很多。B店老板感觉不对，打听到A店老板居然降价了，为了维持住客源，B店老板将价格降到8元一份。于是客人都到了B店这边，然而A店老板继续降价到7元，然后B店降价到6元，A降到5元，B到4元，A3元，B2元。两家店铺的利润已经无法覆盖他们的成本了，于是偷工减料发生了，用低廉的原材料做包子进行内卷，两个老板都杀得头破血流，只有顾客哈哈大笑认为占了大便宜，实际上吃的不知道是什么肉的包子。到了最后，两家店铺都倒闭了，街上的人也吃不到包子了，全输。\n两家店铺内卷，卷到最后店铺和顾客都得不到好处，这就是逐底竞争，是一种恶性竞争模式。如果店铺采用的办法是，通过改进包子的口感，来吸引更多的顾客来这条街上买包子，这将是一种良性的竞争。这种做法本质上是将蛋糕做大，以便获取更多的利益。\n在此前一段时间，城市里到处都是课外补习班。家长们为了自己的孩子能在考试中有个好的排名，将孩子周末和寒暑假都排满了补习班，这样他的孩子就可以在考试中取得更靠前的排名。其他家长见到后，不甘自己的孩子屈于人后，也都纷纷给孩子报了补习班，这样一来，孩子们的排名其实和补习之前并没有什么不同。只是家长花掉了巨额的补习费用，小孩子失去了休息的时间。\n在企业中，企业之间打价格战，打到最后就是两败俱伤，消费者拿到手的产品质量也是越来越差。\n在劳动力市场中，劳工之间内卷工资，导致行业工资下降，谁都没办法获得丰厚的报酬。\n在自媒体领域，某个视频爆火之后，各种模仿者竞相出现，为了博眼球，视频内容不断挑战下限，网络环境乌烟瘴气。\n如果林平之将《辟邪剑谱》撒向整个江湖，谁都可以练，那将会出现什么情况？江湖人士看着手里的《辟邪剑谱》无比纠结，不练吧，怕别人练了，自己不练就只能在江湖最底层挨打。练吧，练完了也就那样，因为大家都练了。于是江湖变成了太监的江湖……\n如果竞争没有底线，消费者只有可能在短期内享受到一定的好处。逐底竞争结束后，或 …","date": "2026-01-13 16:05:00",
    "updated": "2026-01-13 16:05:00"
  }, 
  {
    "objectID": "24d837b1189216a11c2524b460ffa9e566361418",
    "permalink": "/post/knowledge/20260113-import-04/",
    "title": "机会成本、边际成本和沉没成本","content": "机会成本、边际成本和沉没成本\n01\n机会成本\n每当我们做选择的时候，其实就是在考虑机会成本，也就是考虑划不划得来的问题。\n一个直观的例子：\n如果面前有一张100元，一张50元，一张20元的纸币可供选择，且只能选择一张，那么几乎所有人都会选择这一张100元。而如果选择50元，你的机会成本就是50元，因为你本可以获得100元，实际却只获得了50元，你的机会成本就是50元。选择20元，你的机会成本就是80元，因为你本可以获得100元，实际只获得了20元，付出的机会成本就是80元。\n一个不那么直观的例子：\n你现在有两份offer，假设两者工作内容差不多，A工作工资15000，单休；B工作工资12000，双休。从薪资上看，A工作日薪约为600，B工作日薪570，那么应该选择A工作，如果选择B工作，付出的日机会成本就是30元。但如果我们考虑个人成长和休息，A工作要工作6天休息1天，B工作平均工作2.5天就可以休息一天，B工作有更多的时间休息和自我成长，如果你觉得B的休息时间带来的收益远大于那30元钱，那么选B工作才是应该的。\n02\n边际成本\n当你额外生产某个东西时，你需要额外花费的成本就是他的边际成本。\n假设你正在摆摊卖包子，你花了1000元买出摊车和蒸包子的厨具，每份包子的平均原材料（面粉，酵母，燃料，调料等）花费1块钱。你做了100份包子，那么这100份包子每份的平均成本是（1000+100）/100=11块钱，如果你只做10份包子，这10份包子每份的平均成本就是110块钱。那么它的边际成本是多少？不要考虑前期花费，仅考虑你再做一份包子需要花多少钱就可以了，再做一份包子只需要花1块钱的材料费，那么它的边际成本就是1块钱。\n边际成本可以看作是数学上的极限思想，当你生产的包子足够多的时候，算上前期投入的1000元来计算平均成本，这个平均成本就是等于边际成本，比如你做了1万份包子，那么每份包子的平均成本就是1.1元，如果你做了100万份，平均成本就是1.001元，如果你做了无穷多的包子，那么每份包子的平均价成本就是1元，也就是它的边际成本。\n03\n沉没成本\n已经投入进去的成本，就是沉没成本。\n还是假设你摆摊前期花了1000买设备，但是在摆摊前畏缩了，不想去摆摊了，你的沉没成本就是1000元。如果你此时觉得沉没成本很高，决定坚持继续摆摊，你的沉没成本还是1000元。如果你继续做了 …","date": "2026-01-13 16:04:00",
    "updated": "2026-01-13 16:04:00"
  }, 
  {
    "objectID": "ba13204e57013ab075a8ec29c1b01451fcf3d865",
    "permalink": "/post/read/20260113-import-03/",
    "title": "读书 | 《牛奶可乐经济学》","content": "读书 | 《牛奶可乐经济学》 作者：美国 伯特·弗兰克，2008年出版。此书中使用大量实际生活中会遇到的事情解释经济学知识，被认为是非常合适的经济学入门书籍。这本书后续还有3本，推荐继续阅读，因为：“诚如我在引言中所说，即便是在大学上过经济学课程的人，对基本的经济学原理如何运作，也大多不甚了了。因此，从相对的角度来看，你已经成了一个经济学专家。”\n1、为什么女装的扣子在左边，男装的扣子却总在右边\n平时没有留意扣子这个问题，我特意去TB上搜了一下，嘿！还真是这样。一般在我们看起来觉得奇怪的问题，很可能是历史遗留问题。果然，书中对此的解释在于，在早期服装设计上，一般有钱人的衣服上才会有扣子，那个时期有钱女士穿衣服都会有仆人帮忙代劳，而男士一般则自己穿。因为世界上绝大多数人都是右撇子，所以男士的扣子一般在右边，而女士的扣子在左边，规范一经确认，就很难更改了，于是就这么传了下来。\n就像键盘的按键顺序不是从a-z排列一样，键盘最初是使用在打字机上。打字机的机械结构限制了打字速度不能过快，不然会锤杆会相互碰撞导致损坏，所以特意打乱了按键顺序，将常用字母和不常用字母分开，降低打字速度。后来电子键盘出现，却因为大家都习惯了这个布局的键盘，也就是行业规范，也就很难修改键位了。\n2、该花多少钱的参照系变化\n书中提供了一个例子，维多利亚的秘密推出了价值几百万美元的镶钻胸罩，明明没有人买，为什么还要推出这款胸罩呢？当消费者在看到这款价值几百万美元的胸罩之后，再去看公司里那些比普通内衣贵很多的内衣，就会觉得买个几百美元的内衣好像也不是那么不能接受，这就是该花多少钱的参照系发生了改变。\n不喝咖啡的人，会觉得瑞幸15块钱的咖啡好贵，还不如自己买包速溶咖啡冲泡，只要2块钱就好了。但是在看到星巴克三四十元一杯的咖啡后，又会觉得瑞幸只要15块钱就能买到一杯咖啡，实在是划算。消费者在看到超出预期价格的商品之后，会悄然提高自己心里的消费价格底线。\n3、偏好的逆转\n书中举的例子是，一个买房的人看了28万美元的别墅和30万美元的农舍，在两者之间他比较犹豫，心理上更倾向于买28万的别墅，但销售带他看了另一栋32万的稍差一点的农舍后，他就改变主意买那个30万美元的农舍了。当消费者在两种商品中犹豫不决的时候，引入另一个有对比性的，有显而易见的优点或缺点的商品，能够让消费者改变其偏好或者让其更好下决定。\n实际在生活中 …","date": "2026-01-13 16:03:00",
    "updated": "2026-01-13 16:03:00"
  }, 
  {
    "objectID": "6b92c13b547f15cb39d2e60ff2f9f2de8e67fce4",
    "permalink": "/post/read/20260113-import-02/",
    "title": "读书 |《人类简史》","content": "读书 |《人类简史》 书中的几个有意思的地方：\n1、究竟是人类驯服了小麦，还是小麦驯服了人类\n2、人类社会是建立在“虚构”这个能力上的\n3、人类整体的进步不代表个体的幸福\n4、法国大革命的背景\n01\n究竟是人类驯服了小麦，还是小麦驯服了人类\n生物进化成功与否，在于基因拷贝数量，小麦通过人类将自己的基因洒向了全世界，所以有了小麦驯服人类这个观点。但仔细思考一下，驯服指的是通过手段将其他生物改变到适合自己这种生物，用来达到食用或者使用之类的目的。而小麦能实现向全世界播撒种子，是因为它适合作为人类的食物，它们适应了有人类的环境，才有机会大量繁殖。就像是植物的种子，包裹了果肉的果实更容易受到动物的青睐，就更容易将种子带到远方，也就更容易大量繁殖一样，小麦只是恰好演化得更容易被食用，才实现了巨量的基因拷贝。而人类为了小麦而改变的地方在于，人类变成了聚居动物，但是人类变为聚居动物，并不完全是因为小麦，必定有其他食物的影响，可能还有当时社会的关系，人口密度的关系等等的影响。所以说还是人类驯服了小麦，而小麦为这个世界驯服人类的过程出了一点力。\n02\n人类社会是建立在“虚构”这个能力上的\n我们都明白，社会中很多东西其实都只是一个概念，都是“虚构”出来的。这点最直接最明显的就是宗教，宗教通过虚构神的故事，让千万人聚集在一起。而我们都知道，神不存在，甚至宗教里面的很多关于神的描述都是冲突的，以至于一个宗教能分成两派，相互攻讦甚至屠杀。为什么一群互不认识的人想杀了另一群与自己不认识的人？就因为自己这群人相信一个共同的故事，而对面的那群人相信另外一个故事，于是相信同一个故事的人哪怕彼此不认识，也会彼此信任，一起去屠杀相信另一个故事的另一群人。除了宗教，其实我们生活中很多都是虚构的，比如说社团、公司、家族，甚至是国家、文明等。\n03\n人类整体的进步不代表个体的幸福\n鸡鸭猪牛，从基因拷贝数量上看，他们演化的很成功，但成功是他们整体的，个体的鸡鸭猪牛并不幸福，鸡鸭猪出生起就活在拥挤的笼子里，长大后就会被屠宰；奶牛不停地被怀孕被挤奶；但是他们其实应该更喜欢在广阔的大自然生活吧。而一些整体演化并不怎么成功的物种，比如大熊猫（比如只进化了一半的人（大马喽））在动物园吃吃喝喝，混吃等死。人类进化成了世界的主宰，但是对于人类个体来说，很多人都不会觉得自己过得幸福，但就是有人会说，你们现在的年轻人过得够幸福了 …","date": "2026-01-13 16:02:00",
    "updated": "2026-01-13 16:02:00"
  }, 
  {
    "objectID": "77081b7dd6766f94bb7733dc68bba6e520f46143",
    "permalink": "/post/software/20260111-first/",
    "title": "开端-hugo博客搭建-使用reimu主题","content": " 开端-hugo博客搭建-使用reimu主题 1、安装hugo Windows下手动安装hugo步骤：\n1.1、参考文档\nhugo官方中文文档主页：Hugo官方文档中文版|Hugo中文文档 | Hugo官方文档\n1.2、下载安装包\nhugo安装包：Release v0.154.4 · gohugoio/hugo Windows环境下可以下载安装包：hugo_extended_withdeploy_0.154.4_windows-amd64.zip\n1.3、解压缩\n解压缩到F:\\Hugo\\Hugo\n此时hugo.exe应用程序的路径为：F:\\Hugo\\Hugo\\hugo_extended_withdeploy_0.154.3_windows-amd64\n1.4、添加hugo到环境变量\n打开环境变量设置界面：右键我的电脑-属性-高级系统设置-环境变量\n或者按下win键，直接搜索环境变量\n在系统变量中的Path中，新建一个环境变量，将hugo应用程序的路径F:\\Hugo\\Hugo\\hugo_extended_withdeploy_0.154.3_windows-amd64添加进去\n1.5、验证环境\n打开cmd窗口，输入hugo version，没报错就是ok了。\n1.6、创建工程\n新建目录F:\\Hugo\\Project，在这个目录下打开cmd命令窗口，输入hugo new site MyBlog，hugo会自动创建全部工程文件\n2、安装主题 在hugo官方主题网站下，有很多主题可供选择，这里有很多主题，第一眼就看上hugo-theme-reimu这个主题了\n主题：完整列表 | Hugo 主题\n2.1、手动主题下载\nreimu主题下载地址：GitHub - D-Sketon/hugo-theme-reimu: 一款博丽灵梦风格的Hugo主题 | A Hakurei Reimu style Hugo theme. 💘Touhou💘\n进入git界面，点击tags，选择版本v0.14.2，直接点击版本下方的zip下载压缩包：https://github.com/D-Sketon/hugo-theme-reimu/archive/refs/tags/v0.14.2.zip\n2.2、解压缩主题\n将解压后的主题文件，全部复制到工程目录 …","date": "2026-01-11 11:23:47",
    "updated": "2026-01-11 11:23:47"
  }]